[
    {
        "where did you first come across this survey?": "Discord",
        "would you consider yourself to be a programmer or software developer? you can consider yourself a programmer/developer without studying either discipline or doing it as a job.": "Yes, I would",
        "when did you first use tiddlywiki?": "2019",
        "do you currently participate, or have you previously participated in the tiddlywiki community? by \"community\" we refer to official spaces such as talk tiddlywiki as well as online-based third-party communities like the public discord server.": "No",
        "have you ever published a plugin or tiddlywiki extension of another type, which others can find, import and use? we define these as being publicly-hosted on your own webspace, or a host such as tiddlyhost.": "No",
        "how would you describe your main use cases for tiddlywiki?": "Note-taking;Task and project management (including CRMs);Producing/publishing interactive fiction;Worldbuilding (e.g. for role-playing games);Narrative fiction writing (either supporting its creation or directly writing in TiddlyWiki)",
        "do you use tiddlywiki to support with your job or programme of education?": "Not applicable (as retired, etc)",
        "do you share your tiddlywiki(s) with other people? please select 'yes' if there is more than one person who can directly view your wiki.": "No, but I may export content into other formats and share individual tiddlers, the whole wiki, or an extract of the wiki",
        "putting it all together, what value does tiddlywiki provide for you in your day to day work, or in your life?": "It has been a limited but useful resource for organizing and writing my fiction and worldbuilding. Being able to search and sort by tags has been especially useful, as well as being able to write in and display html and markdown pages with custom css. Color coded tags, too.",
        "what is your level of ability with tiddlywiki? this question assumes you can navigate tiddlywiki, use basic wikitext and save changes.": "I have customised TiddlyWiki through options and plugins;I have written custom CSS styles",
        "how do you save changes in tiddlywiki?": "Single-file wiki through web browser with Download Saver (default saving mechanism);Single-file wiki with TiddlyDesktop;Single-file wiki third-party mobile app (e.g. Tiddloid, Quine)",
        "how do you back up/sync changes between systems?": "Neocities, Nekoweb, tiiny.host, omg.lol and similar services;DIY (any other solution)",
        "as you selected diy, would be grateful for more details on the system you use to back up and synchronise your tiddlywiki across devices/systems.": "I use syncthing to sync folders... i store a single file wiki locally and sync across devices.",
        "outside of plugins, palettes and other information captured above; are there any customisations you make to your tiddlywiki? these included but are not limited to: stylesheets, macros/functions/procedures, javascript, and direct edits to the core. please also mention if you used or built on customisations from the community.": "I sometimes poke around but I can’t remember any specific changes.",
        "are you positive about the future prospects of tiddlywiki?": "No",
        "are you confident that tiddlywiki will continue to meet your needs with future development?": "No",
        "are you satisfied with the way the project makes decisions?": "Yes",
        "what are we doing well? prompts for thinking: what are the aspects of tiddlywiki as a project and community that you find appealing? is there anything you are excited for in the future of tiddlywiki?": "The self-editing page stuff is good. The flexibility can be daunting but is ultimately good. The wiki format is very useful. The ability to control how and how many tiddlers are displayed is cool. Being plugin-friendly is very useful. The fact that it’s free, the fact that it’s import/export friendly for the most part... The drag and drop features are cool.",
        "what could we do better? prompts for thinking: could you imagine yourself leaving tiddlywiki? is there something you are afraid of in the future of tiddlywiki? what could change your relationship with tw and its community? what might encourage you to contribute more to the project?": "I’m currently phasing out of tw into just a folder full of sloppy mishmashed files, not because I want to, but because my story is humongous and my wiki is lagging so hard that I’ve lost important writing while editing directly in it. I first moved from google docs to TW for the same reason... googdocs crashed after chapter 13ish, tw crashes after about chapter 50. I’m sad my use case isn’t a neat fit for tw. I looked so hard to find a tool and tw was it. Im out of options. I have to diy it now.",
        "with your consent, we would like to publish responses to this survey on tiddlywiki.com, in the spirit of open development. are you happy for your responses to be available online? we will not include information on your age or country of birth in the public results. those items of information will be kept strictly to a small and trusted group of regular contributors and administrators.": "Yes, I am happy for my responses to be published",
        "title": "Community Survey 2025 Answer 00069",
        "tags": "[[Community Survey 2025]]"
    }
]