[
    {
        "where did you first come across this survey?": "Official newsletter",
        "would you consider yourself to be a programmer or software developer? you can consider yourself a programmer/developer without studying either discipline or doing it as a job.": "Yes, I would",
        "when did you first use tiddlywiki?": "2014",
        "do you currently participate, or have you previously participated in the tiddlywiki community? by \"community\" we refer to official spaces such as talk tiddlywiki as well as online-based third-party communities like the public discord server.": "No",
        "have you ever published a plugin or tiddlywiki extension of another type, which others can find, import and use? we define these as being publicly-hosted on your own webspace, or a host such as tiddlyhost.": "No",
        "how would you describe your main use cases for tiddlywiki?": "Note-taking;Journalling;Task and project management (including CRMs);As a knowledge base (including technical, non-fiction and encyclopaedic content);Worldbuilding (e.g. for role-playing games)",
        "do you use tiddlywiki to support with your job or programme of education?": "Yes",
        "do you share your tiddlywiki(s) with other people? please select 'yes' if there is more than one person who can directly view your wiki.": "Yes, and I am the only editor/administrator of my wiki(s)",
        "do you publish your wiki(s) online?: to the world wide web": "Yes, using a single-file wiki;Yes, served through Node.js",
        "do you publish your wiki(s) online?: to an intranet": "Yes, served through Node.js",
        "putting it all together, what value does tiddlywiki provide for you in your day to day work, or in your life?": "Daily driver to manage rand reflect on my day, organize my work and life, document education, worldbuilding.",
        "what is your level of ability with tiddlywiki? this question assumes you can navigate tiddlywiki, use basic wikitext and save changes.": "I have customised TiddlyWiki through options and plugins;I am comfortable writing filter expressions;I have written custom HTML;I have written custom CSS styles",
        "how do you save changes in tiddlywiki?": "Multi-file wiki served through Node.js",
        "how do you back up/sync changes between systems?": "Git forge (GitHub, Gitea/Forgejo, GitLab);DIY (any other solution)",
        "as you selected diy, would be grateful for more details on the system you use to back up and synchronise your tiddlywiki across devices/systems.": "Syncing files with Synthing, editing and publishing via Node.js server. Creating local git commits as backups / version history.",
        "we would love to know what your basic setup looks like in your most-used wiki. you can import the wiki info tiddler and paste the output below. find the wiki information tool here.": "<details><summary>Wiki Information</summary><pre><code>\nTiddlyWiki Version: 5.3.5\nCurrent palette: $:/palettes/Vanilla\nCurrent theme: $:/themes/tiddlywiki/vanilla\nCurrent layout: \nBrowser language setting: en-US\nDefault type for missing tiddlers: \nAuto save setting: yes\nCode wrapping setting: pre-wrap\nSticky titles setting: no\nSidebar layout setting: fluid-fixed\nAuto focus field setting for new tiddlers: title\nCurrent storyview setting: top\nToolbar text setting: no\nToolbar icon setting: yes\nButton class setting: tc-btn-invisible\nNavigation address bar setting: no\nTiddler opening behaviour setting for navigations from outside the story river: top\nTiddler opening behaviour setting for navigations from within the story river: above\nCamelCase linking setting: disable\nKeyboard shortcuts that have been customised: $:/config/shortcuts-mac/new-week,$:/config/shortcuts/link,$:/config/shortcuts/list-subtask,$:/config/shortcuts/list-task,$:/config/shortcuts/list-time,$:/config/shortcuts/new-week\nDisabled plugins: \nPlugins: \n  $:/core - 5.3.5\n  $:/plugins/danielo515/ContextPlugin - 2.1.0\n  $:/plugins/felixhayashi/hotzone - 0.0.3\n  $:/plugins/felixhayashi/tiddlymap - 0.16.1+9773\n  $:/plugins/felixhayashi/topstoryview - 0.2.0\n  $:/plugins/felixhayashi/vis - 4.21.0-SNAPSHOT\n  $:/plugins/snowgoon88/edit-comptext - 0.8.1\n  $:/plugins/TheDiveO/FontAwesome - 1.2.18\n  $:/plugins/tiddlywiki/filesystem - 5.3.5\n  $:/plugins/tiddlywiki/highlight - 5.3.5\n  $:/plugins/tiddlywiki/markdown - 5.1.14\n  $:/plugins/tiddlywiki/tiddlyweb - 5.3.5\n  $:/temp/info-plugin - \n  $:/themes/telmiger/bricks-004 - 0.0.7\n  $:/themes/tiddlywiki/snowwhite - 5.3.5\n  $:/themes/tiddlywiki/vanilla - 5.3.5\n</code></pre></details>",
        "outside of plugins, palettes and other information captured above; are there any customisations you make to your tiddlywiki? these included but are not limited to: stylesheets, macros/functions/procedures, javascript, and direct edits to the core. please also mention if you used or built on customisations from the community.": "I have a custom stylesheet to render checkboxes, in addition to a daily journal tidder I have a weekly tiddler (with weekly goals, tasks and a journal summary), and a custom \"dashboard\" tiddler that shows an overview of projects, open tasks, and a custom table of contents.",
        "are you positive about the future prospects of tiddlywiki?": "Yes",
        "are you confident that tiddlywiki will continue to meet your needs with future development?": "Yes",
        "are you satisfied with the way the project makes decisions?": "Yes",
        "what are we doing well? prompts for thinking: what are the aspects of tiddlywiki as a project and community that you find appealing? is there anything you are excited for in the future of tiddlywiki?": "Incredibly robust and fast product, I never had problems upgrading (even very large and old wikis), it just works. New features are announced non-intrusively (I'm not forced to use them). Open and transparent community with a big heart. Thank you for everything!",
        "what could we do better? prompts for thinking: could you imagine yourself leaving tiddlywiki? is there something you are afraid of in the future of tiddlywiki? what could change your relationship with tw and its community? what might encourage you to contribute more to the project?": "I did not find a good setup to sync wikis to my mobile devices (iOS and Android). I would love an app where I could run a local Node.js version and point it to a directory of tiddlers. Syncing these tiddlers could be done outside the app.",
        "with your consent, we would like to publish responses to this survey on tiddlywiki.com, in the spirit of open development. are you happy for your responses to be available online? we will not include information on your age or country of birth in the public results. those items of information will be kept strictly to a small and trusted group of regular contributors and administrators.": "Yes, I am happy for my responses to be published",
        "title": "Community Survey 2025 Answer 00083",
        "tags": "[[Community Survey 2025]]"
    }
]