[
    {
        "where did you first come across this survey?": "Talk TiddlyWiki",
        "would you consider yourself to be a programmer or software developer? you can consider yourself a programmer/developer without studying either discipline or doing it as a job.": "Yes, I would",
        "when did you first use tiddlywiki?": "2022",
        "do you currently participate, or have you previously participated in the tiddlywiki community? by \"community\" we refer to official spaces such as talk tiddlywiki as well as online-based third-party communities like the public discord server.": "Yes",
        "when did you begin taking part in the tiddlywiki community?": "2022",
        "we would be interested in knowing how you engage with the different communities of tw.: talk tiddlywiki": "I read and post in this community",
        "we would be interested in knowing how you engage with the different communities of tw.: old mailing list (google group)": "I do not engage with this community",
        "we would be interested in knowing how you engage with the different communities of tw.: r/tiddlywiki5 on reddit": "I do not engage with this community",
        "we would be interested in knowing how you engage with the different communities of tw.: discord": "I read/lurk, but do not post",
        "we would be interested in knowing how you engage with the different communities of tw.: github discussions": "I read/lurk, but do not post",
        "have you ever published a plugin or tiddlywiki extension of another type, which others can find, import and use? we define these as being publicly-hosted on your own webspace, or a host such as tiddlyhost.": "No",
        "how would you describe your main use cases for tiddlywiki?": "Note-taking;Journalling;Task and project management (including CRMs);As a knowledge base (including technical, non-fiction and encyclopaedic content);Programming;Other",
        "as you selected other: what are other primary use cases of tiddlywiki for you?": "building websites",
        "do you use tiddlywiki to support with your job or programme of education?": "Yes",
        "do you share your tiddlywiki(s) with other people? please select 'yes' if there is more than one person who can directly view your wiki.": "Yes, and I am the only editor/administrator of my wiki(s)",
        "do you publish your wiki(s) online?: to the world wide web": "Yes, using a single-file wiki;Yes, served through Node.js",
        "do you publish your wiki(s) online?: to an intranet": "Not publishing to this location",
        "putting it all together, what value does tiddlywiki provide for you in your day to day work, or in your life?": "TiddlyWiki provides a place to put stuff - notes, todos, project plans, blog posts, reference materials, etc. - and a framework for stitching those things together. It also provides a nice way to create a lightweight database / website.",
        "what is your level of ability with tiddlywiki? this question assumes you can navigate tiddlywiki, use basic wikitext and save changes.": "I have customised TiddlyWiki through options and plugins;I am comfortable using WikiText widgets (e.g. <$transclude>, <$list>...);I am comfortable writing filter expressions;I have written custom HTML;I have written custom CSS styles",
        "how do you save changes in tiddlywiki?": "Multi-file wiki served through Node.js;Single-file wiki with TiddlyDesktop;Single-file wiki third-party mobile app (e.g. Tiddloid, Quine)",
        "how do you back up/sync changes between systems?": "Consumer online storage (e.g. Google Drive, Dropbox);DIY (any other solution)",
        "as you selected diy, would be grateful for more details on the system you use to back up and synchronise your tiddlywiki across devices/systems.": "I have a self-hosted git instance, and I use launchd / Siri Shortcuts to keep the git repo up to date.",
        "we would love to know what your basic setup looks like in your most-used wiki. you can import the wiki info tiddler and paste the output below. find the wiki information tool here.": "<details><summary>Wiki Information</summary><pre><code>\nTiddlyWiki Version: 5.3.6\nCurrent palette: $:/palettes/peter\nCurrent theme: $:/themes/tiddlywiki/snowwhite\nCurrent layout: \nBrowser language setting: en-US\nDefault type for missing tiddlers: \nAuto save setting: yes\nCode wrapping setting: pre-wrap\nSticky titles setting: no\nSidebar layout setting: fluid-fixed\nAuto focus field setting for new tiddlers: title\nCurrent storyview setting: classic\nToolbar text setting: no\nToolbar icon setting: yes\nButton class setting: tc-btn-invisible\nNavigation address bar setting: no\nTiddler opening behaviour setting for navigations from outside the story river: top\nTiddler opening behaviour setting for navigations from within the story river: below\nCamelCase linking setting: disable\nKeyboard shortcuts that have been customised: $:/config/shortcuts-mac/EC-GoToModal,$:/config/shortcuts-mac/excise,$:/config/shortcuts-mac/layout-switcher,$:/config/shortcuts-mac/new-markdown-tiddler,$:/config/shortcuts-mac/new-tiddler,$:/config/shortcuts-mac/open-command-palette,$:/config/shortcuts-mac/py-quick-capture,$:/config/shortcuts-not-mac/new-markdown-tiddler,$:/config/shortcuts-not-mac/new-tiddler,$:/config/shortcuts/EC-AutoComplete,$:/config/shortcuts/excise,$:/config/shortcuts/link,$:/config/shortcuts/notebook-focus-search,$:/config/shortcuts/open-command-palette-command-mode,$:/config/shortcuts/open-command-palette-selection\nDisabled plugins: $:/plugins/Gk0Wk/notionpage-covericon,$:/plugins/souk21/commandpalette\nPlugins: \n  $:/core - 5.3.6\n  $:/languages/en-US - 5.3.6\n  $:/plugins/EvidentlyCube/AutoComplete - 1.0.20\n  $:/plugins/felixhayashi/hotzone - 0.0.3\n  $:/plugins/flibbles/relink - 2.4.5\n  $:/plugins/flibbles/relink-markdown - 2.4.0\n  $:/plugins/Gk0Wk/CPL-Repo - 2024.11.25\n  $:/plugins/Gk0Wk/echarts - 0.2.13\n  $:/plugins/Gk0Wk/focused-tiddler - 0.0.3\n  $:/plugins/kixam/datepicker - 0.5.2\n  $:/plugins/kixam/moment - 2.24.0\n  $:/plugins/kookma/commander - 2.1.13\n  $:/plugins/kookma/tamasha - 0.6.1\n  $:/plugins/linonetwo/autocomplete - 0.4.0\n  $:/plugins/linonetwo/commandpalette - 2.0.2\n  $:/plugins/linonetwo/krystal - 0.7.0\n  $:/plugins/linonetwo/tw-react - 1.0.0\n  $:/plugins/linonetwo/tw-whiteboard - 1.7.0\n  $:/plugins/nico/projectify - 0.14.0\n  $:/plugins/telmiger/EditButtons - 1.1.0\n  $:/plugins/tiddlywiki/browser-sniff - 5.3.6\n  $:/plugins/tiddlywiki/external-attachments - 5.3.6\n  $:/plugins/tiddlywiki/markdown - 5.3.6\n  $:/plugins/tobibeer/appear - 0.6.2\n  $:/plugins/TWaddle/pluginsize - 1.0.0\n  $:/temp/info-plugin - \n  $:/themes/nico/notebook - 1.4.1\n  $:/themes/tiddlywiki/centralised - 5.3.6\n  $:/themes/tiddlywiki/snowwhite - 5.3.6\n  $:/themes/tiddlywiki/vanilla - 5.3.6\n</code></pre></details>",
        "outside of plugins, palettes and other information captured above; are there any customisations you make to your tiddlywiki? these included but are not limited to: stylesheets, macros/functions/procedures, javascript, and direct edits to the core. please also mention if you used or built on customisations from the community.": "* Custom stylesheets to turn on multi-column / grid-based layout for tiddlers\n* Custom \"HUD\" system for showing tiddlers on computer sidebar and phone background\n* Custom GTD system\n* Plugin (in-development, but early version used) to show TW in 3D",
        "are you positive about the future prospects of tiddlywiki?": "Yes",
        "are you confident that tiddlywiki will continue to meet your needs with future development?": "Yes",
        "are you satisfied with the way the project makes decisions?": "No",
        "what are we doing well? prompts for thinking: what are the aspects of tiddlywiki as a project and community that you find appealing? is there anything you are excited for in the future of tiddlywiki?": "I think the community is a supportive and welcoming environment. People help each other and share tips and tricks. I really like how focused TiddlyWiki is on privacy and autonomy. Jeremy is a great steward of the project and takes great care in steering TiddlyWiki.\n\nI'm very excited to follow the progress on 5.4.0!",
        "what could we do better? prompts for thinking: could you imagine yourself leaving tiddlywiki? is there something you are afraid of in the future of tiddlywiki? what could change your relationship with tw and its community? what might encourage you to contribute more to the project?": "I'd like the project to go faster. Sometimes, pull requests with new features languish for months and await merging / discussion. It'd be good to review these with a working group and get them pushed along.\n\nI also want the project to \"branch out\". We should work on marketing TW to the \"PKM\" community as a real alternative, and speak about it.",
        "with your consent, we would like to publish responses to this survey on tiddlywiki.com, in the spirit of open development. are you happy for your responses to be available online? we will not include information on your age or country of birth in the public results. those items of information will be kept strictly to a small and trusted group of regular contributors and administrators.": "Yes, I am happy for my responses to be published",
        "title": "Community Survey 2025 Answer 00041",
        "tags": "[[Community Survey 2025]]"
    }
]