[
    {
        "where did you first come across this survey?": "Other",
        "as you selected other, could you please provide more information on where you initially found this survey?": "Online blog about FOSS notetaking apps as alternatives to OneNote",
        "would you consider yourself to be a programmer or software developer? you can consider yourself a programmer/developer without studying either discipline or doing it as a job.": "Yes, I would",
        "when did you first use tiddlywiki?": "2020",
        "do you currently participate, or have you previously participated in the tiddlywiki community? by \"community\" we refer to official spaces such as talk tiddlywiki as well as online-based third-party communities like the public discord server.": "Yes",
        "when did you begin taking part in the tiddlywiki community?": "2021",
        "we would be interested in knowing how you engage with the different communities of tw.: talk tiddlywiki": "I read and post in this community",
        "we would be interested in knowing how you engage with the different communities of tw.: old mailing list (google group)": "I read/lurk, but do not post",
        "we would be interested in knowing how you engage with the different communities of tw.: r/tiddlywiki5 on reddit": "I read/lurk, but do not post",
        "we would be interested in knowing how you engage with the different communities of tw.: discord": "I do not engage with this community",
        "we would be interested in knowing how you engage with the different communities of tw.: github discussions": "I read/lurk, but do not post",
        "have you ever published a plugin or tiddlywiki extension of another type, which others can find, import and use? we define these as being publicly-hosted on your own webspace, or a host such as tiddlyhost.": "Yes",
        "how would you describe your main use cases for tiddlywiki?": "Note-taking;Journalling;As a knowledge base (including technical, non-fiction and encyclopaedic content);Worldbuilding (e.g. for role-playing games);Other",
        "as you selected other: what are other primary use cases of tiddlywiki for you?": "Recording plaintext config files, such as CFG files for Counterstrike or Keyboard layouts for Heliboard, as well as OSINT profiles for work.",
        "do you use tiddlywiki to support with your job or programme of education?": "Yes",
        "do you share your tiddlywiki(s) with other people? please select 'yes' if there is more than one person who can directly view your wiki.": "No, my TiddlyWiki is for personal use only",
        "putting it all together, what value does tiddlywiki provide for you in your day to day work, or in your life?": "It serves the same purpose as a pocket notebook or pocket journal, but infinitely more valuable to me.",
        "what is your level of ability with tiddlywiki? this question assumes you can navigate tiddlywiki, use basic wikitext and save changes.": "I have customised TiddlyWiki through options and plugins;I am comfortable using WikiText widgets (e.g. <$transclude>, <$list>...);I am comfortable writing filter expressions;I have written custom HTML;I have written custom CSS styles",
        "how do you save changes in tiddlywiki?": "Single-file wiki through web browser with Download Saver (default saving mechanism);Single-file wiki third-party mobile app (e.g. Tiddloid, Quine)",
        "how do you back up/sync changes between systems?": "TiddlySpot / TiddlyHost;Git forge (GitHub, Gitea/Forgejo, GitLab);No automatic sync across my devices;N/A - I keep my wiki on a single system",
        "we would love to know what your basic setup looks like in your most-used wiki. you can import the wiki info tiddler and paste the output below. find the wiki information tool here.": "I am on mobile and unable to do so, but it is close to vanilla, with minor changes, such as a left sidebar, more responsive button elements (mouse cursor to pointer on clickable elements) a few quality of life plugins, but overall nothing advanced.",
        "outside of plugins, palettes and other information captured above; are there any customisations you make to your tiddlywiki? these included but are not limited to: stylesheets, macros/functions/procedures, javascript, and direct edits to the core. please also mention if you used or built on customisations from the community.": "Adjustments to core and boot tiddlers, increased encryption to 256 aes, left sidebar plugin, etc.",
        "are you positive about the future prospects of tiddlywiki?": "Yes",
        "are you confident that tiddlywiki will continue to meet your needs with future development?": "Yes",
        "are you satisfied with the way the project makes decisions?": "Yes",
        "what are we doing well? prompts for thinking: what are the aspects of tiddlywiki as a project and community that you find appealing? is there anything you are excited for in the future of tiddlywiki?": "When le thongs are slower because it is community run and organized, I think the outcome of decisions is ideal. I would rather slow and steady improvements that cater to what users want vs what most corporations do.",
        "what could we do better? prompts for thinking: could you imagine yourself leaving tiddlywiki? is there something you are afraid of in the future of tiddlywiki? what could change your relationship with tw and its community? what might encourage you to contribute more to the project?": "Making documentation easier to consume, such as more examples, possibly using images or web gift showing usage of different features, discussions about why one feature superseded another, recommended uses to achieve some functions, etc.\n\nI also think a more public face would be good. I.e. a YouTube channel showing how to start with TW and get to a point where all aspects have been changed in some way.",
        "with your consent, we would like to publish responses to this survey on tiddlywiki.com, in the spirit of open development. are you happy for your responses to be available online? we will not include information on your age or country of birth in the public results. those items of information will be kept strictly to a small and trusted group of regular contributors and administrators.": "Yes, I am happy for my responses to be published",
        "title": "Community Survey 2025 Answer 00116",
        "tags": "[[Community Survey 2025]]"
    }
]