[
    {
        "first-heard-survey": "Other",
        "other-survey-source": "Online blog about FOSS notetaking apps as alternatives to OneNote",
        "are-you-a-dev": "Yes, I would",
        "first-used-tw": "2020",
        "joined-tw-community": "Yes",
        "started-tw-community": "2021",
        "use-ttw": "I read and post in this community",
        "use-mailing-list": "I read/lurk, but do not post",
        "use-reddit": "I read/lurk, but do not post",
        "use-discord": "I do not engage with this community",
        "use-github-discuss": "I read/lurk, but do not post",
        "published-plugin": "Yes",
        "main-use-cases": "Note-taking;Journalling;As a knowledge base (including technical, non-fiction and encyclopaedic content);Worldbuilding (e.g. for role-playing games);Other",
        "other-use-cases": "Recording plaintext config files, such as CFG files for Counterstrike or Keyboard layouts for Heliboard, as well as OSINT profiles for work.",
        "use-for-work-or-study": "Yes",
        "share-wikis": "No, my TiddlyWiki is for personal use only",
        "publish-to-web": "",
        "publish-to-intranet": "",
        "value-of-tw": "It serves the same purpose as a pocket notebook or pocket journal, but infinitely more valuable to me.",
        "tw-ability-level": "I have customised TiddlyWiki through options and plugins;I am comfortable using WikiText widgets (e.g. <$transclude>, <$list>...);I am comfortable writing filter expressions;I have written custom HTML;I have written custom CSS styles",
        "save-method": "Single-file wiki through web browser with Download Saver (default saving mechanism);Single-file wiki third-party mobile app (e.g. Tiddloid, Quine)",
        "backup-method": "TiddlySpot / TiddlyHost;Git forge (GitHub, Gitea/Forgejo, GitLab);No automatic sync across my devices;N/A - I keep my wiki on a single system",
        "diy-backup-info": "",
        "wiki-setup-info": "I am on mobile and unable to do so, but it is close to vanilla, with minor changes, such as a left sidebar, more responsive button elements (mouse cursor to pointer on clickable elements) a few quality of life plugins, but overall nothing advanced.",
        "tw-customisations": "Adjustments to core and boot tiddlers, increased encryption to 256 aes, left sidebar plugin, etc.",
        "positive-about-future": "Yes",
        "tw-future-confidence": "Yes",
        "project-decision-trust": "Yes",
        "project-strengths": "When le thongs are slower because it is community run and organized, I think the outcome of decisions is ideal. I would rather slow and steady improvements that cater to what users want vs what most corporations do.",
        "project-weaknesses": "Making documentation easier to consume, such as more examples, possibly using images or web gift showing usage of different features, discussions about why one feature superseded another, recommended uses to achieve some functions, etc.\n\nI also think a more public face would be good. I.e. a YouTube channel showing how to start with TW and get to a point where all aspects have been changed in some way.",
        "ok-to-publish": "Yes, I am happy for my responses to be published",
        "title": "Community Survey 2025 Answer 00116",
        "tags": "[[Community Survey 2025]]"
    }
]