[
    {
        "where did you first come across this survey?": "Discord",
        "would you consider yourself to be a programmer or software developer? you can consider yourself a programmer/developer without studying either discipline or doing it as a job.": "No, I would not",
        "when did you first use tiddlywiki?": "2018",
        "do you currently participate, or have you previously participated in the tiddlywiki community? by \"community\" we refer to official spaces such as talk tiddlywiki as well as online-based third-party communities like the public discord server.": "Yes",
        "when did you begin taking part in the tiddlywiki community?": "2024",
        "we would be interested in knowing how you engage with the different communities of tw.: talk tiddlywiki": "I read and post in this community",
        "we would be interested in knowing how you engage with the different communities of tw.: old mailing list (google group)": "I do not engage with this community",
        "we would be interested in knowing how you engage with the different communities of tw.: r/tiddlywiki5 on reddit": "I do not engage with this community",
        "we would be interested in knowing how you engage with the different communities of tw.: discord": "I read and post in this community",
        "we would be interested in knowing how you engage with the different communities of tw.: github discussions": "I read/lurk, but do not post",
        "have you ever published a plugin or tiddlywiki extension of another type, which others can find, import and use? we define these as being publicly-hosted on your own webspace, or a host such as tiddlyhost.": "No",
        "how would you describe your main use cases for tiddlywiki?": "Note-taking;As a knowledge base (including technical, non-fiction and encyclopaedic content);Worldbuilding (e.g. for role-playing games);Narrative fiction writing (either supporting its creation or directly writing in TiddlyWiki)",
        "do you use tiddlywiki to support with your job or programme of education?": "Not applicable (as retired, etc)",
        "do you share your tiddlywiki(s) with other people? please select 'yes' if there is more than one person who can directly view your wiki.": "Yes, and I am the only editor/administrator of my wiki(s)",
        "do you publish your wiki(s) online?: to the world wide web": "Not publishing to this location",
        "do you publish your wiki(s) online?: to an intranet": "Not publishing to this location",
        "putting it all together, what value does tiddlywiki provide for you in your day to day work, or in your life?": "For me, TW is primarily an extensible platform with which I can shape tools to help me. The portability and compatibility of the single HTML-file is a great boon.",
        "what is your level of ability with tiddlywiki? this question assumes you can navigate tiddlywiki, use basic wikitext and save changes.": "I have customised TiddlyWiki through options and plugins;I am comfortable using WikiText widgets (e.g. <$transclude>, <$list>...);I am comfortable writing filter expressions;I have written custom HTML;I have written custom CSS styles",
        "how do you save changes in tiddlywiki?": "Single-file wiki through web browser with Download Saver (default saving mechanism);Single-file wiki with custom saver (e.g. TiddlyPWA, Timimi, tw5-browser-nativesaver);Single-file wiki with TiddlyDesktop;Single-file wiki third-party mobile app (e.g. Tiddloid, Quine)",
        "how do you back up/sync changes between systems?": "DIY (any other solution)",
        "as you selected diy, would be grateful for more details on the system you use to back up and synchronise your tiddlywiki across devices/systems.": "Syncthing.",
        "outside of plugins, palettes and other information captured above; are there any customisations you make to your tiddlywiki? these included but are not limited to: stylesheets, macros/functions/procedures, javascript, and direct edits to the core. please also mention if you used or built on customisations from the community.": "I try to make my changes update-compatible, so I primarily stick to shaping and adding to the core by CSS, functions/procedures and the occasional JS.",
        "are you positive about the future prospects of tiddlywiki?": "Yes",
        "are you confident that tiddlywiki will continue to meet your needs with future development?": "Yes",
        "are you satisfied with the way the project makes decisions?": "Yes",
        "what are we doing well? prompts for thinking: what are the aspects of tiddlywiki as a project and community that you find appealing? is there anything you are excited for in the future of tiddlywiki?": "From what I've seen of the comments regarding TW itself, the dev team seems to have a good balance between retaining the expected functionality of TW, its legacy implementations and the general computing principle that I think lies at the heart of the project while steadily moving forward and adapting new technology as it becomes mature.",
        "what could we do better? prompts for thinking: could you imagine yourself leaving tiddlywiki? is there something you are afraid of in the future of tiddlywiki? what could change your relationship with tw and its community? what might encourage you to contribute more to the project?": "I think the core HTML/CSS layout is getting rather dated and could benefit quite a lot from moving into a more current FlexBox/Grid setup. Not only would it likely make it more consistent and easier to read, but also easier to customise.\n\nAlso, while I gather the TW core has gotten a lot less messy in recent iterations, there is definitely more work to do here. It can be bewildering to wrap your head around.",
        "with your consent, we would like to publish responses to this survey on tiddlywiki.com, in the spirit of open development. are you happy for your responses to be available online? we will not include information on your age or country of birth in the public results. those items of information will be kept strictly to a small and trusted group of regular contributors and administrators.": "Yes, I am happy for my responses to be published",
        "title": "Community Survey 2025 Answer 00086",
        "tags": "[[Community Survey 2025]]"
    }
]