[
    {
        "where did you first come across this survey?": "Other",
        "as you selected other, could you please provide more information on where you initially found this survey?": "Most likely a Linux Forum. I can't honestly remember. I'm a Linux enthusiast and I had it on a floppy disk. It was likely before 2006.",
        "would you consider yourself to be a programmer or software developer? you can consider yourself a programmer/developer without studying either discipline or doing it as a job.": "Yes, I would",
        "do you currently participate, or have you previously participated in the tiddlywiki community? by \"community\" we refer to official spaces such as talk tiddlywiki as well as online-based third-party communities like the public discord server.": "No",
        "have you ever published a plugin or tiddlywiki extension of another type, which others can find, import and use? we define these as being publicly-hosted on your own webspace, or a host such as tiddlyhost.": "No",
        "how would you describe your main use cases for tiddlywiki?": "Note-taking;Journalling;Task and project management (including CRMs);As a knowledge base (including technical, non-fiction and encyclopaedic content)",
        "do you use tiddlywiki to support with your job or programme of education?": "Yes",
        "do you share your tiddlywiki(s) with other people? please select 'yes' if there is more than one person who can directly view your wiki.": "No, but I may export content into other formats and share individual tiddlers, the whole wiki, or an extract of the wiki",
        "putting it all together, what value does tiddlywiki provide for you in your day to day work, or in your life?": "I use TiddlyWiki for thought streams. I don't use it frequently, but it helps me map out my thoughts when I do use it. I have also demonstrated TiddlyWiki to friends and colleagues who find it helpful. Some have even gone on to use it more than I have.",
        "what is your level of ability with tiddlywiki? this question assumes you can navigate tiddlywiki, use basic wikitext and save changes.": "My use is basic; I use TiddlyWiki in a configuration close to standard, without plugins",
        "how do you save changes in tiddlywiki?": "Single-file wiki through web browser with Download Saver (default saving mechanism)",
        "how do you back up/sync changes between systems?": "No automatic sync across my devices",
        "are you positive about the future prospects of tiddlywiki?": "Yes",
        "are you confident that tiddlywiki will continue to meet your needs with future development?": "Yes",
        "are you satisfied with the way the project makes decisions?": "Yes",
        "what are we doing well? prompts for thinking: what are the aspects of tiddlywiki as a project and community that you find appealing? is there anything you are excited for in the future of tiddlywiki?": "TBH - I still run across TiddlyWiki files from when I first started using it (classic) - and they still work. So, I do not doubt that I can continue using it in the future. Some of my toddlers are new (v5) and I expect them to work as well.\nOnce I first figured out TW, it just clicked. I never became very involved in the community. But I may start looking into developing customization - not sure what, yet.",
        "what could we do better? prompts for thinking: could you imagine yourself leaving tiddlywiki? is there something you are afraid of in the future of tiddlywiki? what could change your relationship with tw and its community? what might encourage you to contribute more to the project?": "Although I've used TW for many years, I'm just starting to look into the community. In my opinion, from what I can tell, things are good.\nThe only reason I would stop using TW is if it became dependent on some technology that I do not have access to.\nEveryone that I've introduced to TW was also blown away by the capability and simplicity. So no issues.\nThanks!",
        "with your consent, we would like to publish responses to this survey on tiddlywiki.com, in the spirit of open development. are you happy for your responses to be available online? we will not include information on your age or country of birth in the public results. those items of information will be kept strictly to a small and trusted group of regular contributors and administrators.": "Yes, I am happy for my responses to be published",
        "title": "Community Survey 2025 Answer 00131",
        "tags": "[[Community Survey 2025]]"
    }
]