[
    {
        "where did you first come across this survey?": "tiddlywiki.com",
        "would you consider yourself to be a programmer or software developer? you can consider yourself a programmer/developer without studying either discipline or doing it as a job.": "No, I would not",
        "when did you first use tiddlywiki?": "2016",
        "do you currently participate, or have you previously participated in the tiddlywiki community? by \"community\" we refer to official spaces such as talk tiddlywiki as well as online-based third-party communities like the public discord server.": "Yes",
        "when did you begin taking part in the tiddlywiki community?": "2016",
        "we would be interested in knowing how you engage with the different communities of tw.: talk tiddlywiki": "I read/lurk, but do not post",
        "we would be interested in knowing how you engage with the different communities of tw.: old mailing list (google group)": "I read/lurk, but do not post",
        "we would be interested in knowing how you engage with the different communities of tw.: r/tiddlywiki5 on reddit": "I do not engage with this community",
        "we would be interested in knowing how you engage with the different communities of tw.: discord": "I do not engage with this community",
        "we would be interested in knowing how you engage with the different communities of tw.: github discussions": "I read/lurk, but do not post",
        "have you ever published a plugin or tiddlywiki extension of another type, which others can find, import and use? we define these as being publicly-hosted on your own webspace, or a host such as tiddlyhost.": "No",
        "how would you describe your main use cases for tiddlywiki?": "Note-taking;Task and project management (including CRMs);As a knowledge base (including technical, non-fiction and encyclopaedic content)",
        "do you use tiddlywiki to support with your job or programme of education?": "Yes",
        "do you share your tiddlywiki(s) with other people? please select 'yes' if there is more than one person who can directly view your wiki.": "No, but I may export content into other formats and share individual tiddlers, the whole wiki, or an extract of the wiki",
        "putting it all together, what value does tiddlywiki provide for you in your day to day work, or in your life?": "TiddlyWiki is my primary tool for organizing my daily work as well as personal life. I like the concept of customization, privacy, and modularized plugins.   ",
        "what is your level of ability with tiddlywiki? this question assumes you can navigate tiddlywiki, use basic wikitext and save changes.": "I have customised TiddlyWiki through options and plugins;I am comfortable using WikiText widgets (e.g. <$transclude>, <$list>...);I am comfortable writing filter expressions;I have written custom HTML;I have written custom CSS styles",
        "how do you save changes in tiddlywiki?": "Single-file wiki through web browser with Download Saver (default saving mechanism)",
        "how do you back up/sync changes between systems?": "Consumer online storage (e.g. Google Drive, Dropbox)",
        "we would love to know what your basic setup looks like in your most-used wiki. you can import the wiki info tiddler and paste the output below. find the wiki information tool here.": "<details><summary>Wiki Information</summary><pre><code>\nTiddlyWiki Version: 5.3.5\nCurrent palette: $:/palettes/Blue\nCurrent theme: $:/themes/tiddlywiki/snowwhite\nCurrent layout: $:/core/ui/PageTemplate\nBrowser language setting: en-US\nDefault type for missing tiddlers: \nAuto save setting: yes\nCode wrapping setting: pre-wrap\nSticky titles setting: no\nSidebar layout setting: fixed-fluid\nAuto focus field setting for new tiddlers: title\nCurrent storyview setting: zoomin\nToolbar text setting: no\nToolbar icon setting: yes\nButton class setting: tc-btn-invisible\nNavigation address bar setting: no\nTiddler opening behaviour setting for navigations from outside the story river: top\nTiddler opening behaviour setting for navigations from within the story river: above\nCamelCase linking setting: disable\nKeyboard shortcuts that have been customised: $:/config/shortcuts/mono-block,$:/config/shortcuts/sticky\nDisabled plugins: $:/plugins/kookma/narenj,$:/plugins/tobibeer/appear,$:/plugins/tobibeer/inc,$:/plugins/tobibeer/preview\nPlugins: \n  $:/core - 5.3.5\n  $:/plugins/danielo515/2click2edit - 0.1\n  $:/plugins/flibbles/relink - 2.3.1\n  $:/plugins/jerojasro/copyhtml - 0.0.1\n  $:/plugins/kixam/datepicker - 0.5.2\n  $:/plugins/kixam/moment - 2.24.0\n  $:/plugins/kookma/commander - 2.1.6\n  $:/plugins/kookma/section - 1.2.2\n  $:/plugins/kookma/trashbin - 1.2.2\n  $:/plugins/PSaT/new-windows - 0.6.1\n  $:/plugins/snowgoon88/edit-comptext - 0.9.3\n  $:/plugins/sq/editor-autolist - 0.1.10\n  $:/plugins/stobot/sticky - 0.1.30\n  $:/plugins/tg/layout - 0.5.2\n  $:/plugins/tg/tiddlersbar - 0.0.19\n  $:/plugins/tiddlywiki/menubar - 5.3.5\n  $:/temp/info-plugin - \n  $:/themes/tiddlywiki/snowwhite - 5.3.5\n  $:/themes/tiddlywiki/vanilla - 5.3.5\n</code></pre></details>",
        "outside of plugins, palettes and other information captured above; are there any customisations you make to your tiddlywiki? these included but are not limited to: stylesheets, macros/functions/procedures, javascript, and direct edits to the core. please also mention if you used or built on customisations from the community.": "Mostly I use customized CSS and a bit of macros.",
        "are you positive about the future prospects of tiddlywiki?": "Yes",
        "are you confident that tiddlywiki will continue to meet your needs with future development?": "Yes",
        "are you satisfied with the way the project makes decisions?": "Yes",
        "what are we doing well? prompts for thinking: what are the aspects of tiddlywiki as a project and community that you find appealing? is there anything you are excited for in the future of tiddlywiki?": "Thank you for providing such an incredible tool! Its powerful customization capabilities truly break the boundaries of what TiddlyWiki can do. With the support from community, I genuinely believe TiddlyWiki is on its way to becoming one of the top note-taking solutions in the world.",
        "what could we do better? prompts for thinking: could you imagine yourself leaving tiddlywiki? is there something you are afraid of in the future of tiddlywiki? what could change your relationship with tw and its community? what might encourage you to contribute more to the project?": "Honestly, I can't imagine ever leaving TiddlyWiki — it's become an essential part of my workflow. The fact that it's a self-contained HTML file that lives on my machine gives me a sense of control and permanence that's rare in modern tools. My only slight concern is future browser compatibility, but I trust the community will continue to adapt and evolve. While I'm not a trained programmer, I do wish I could contribute more directly. That said, the work you're doing is fantastic — please keep it",
        "with your consent, we would like to publish responses to this survey on tiddlywiki.com, in the spirit of open development. are you happy for your responses to be available online? we will not include information on your age or country of birth in the public results. those items of information will be kept strictly to a small and trusted group of regular contributors and administrators.": "Yes, I am happy for my responses to be published",
        "title": "Community Survey 2025 Answer 00141",
        "tags": "[[Community Survey 2025]]"
    }
]