[
    {
        "where did you first come across this survey?": "Discord",
        "would you consider yourself to be a programmer or software developer? you can consider yourself a programmer/developer without studying either discipline or doing it as a job.": "Yes, I would",
        "when did you first use tiddlywiki?": "2021",
        "do you currently participate, or have you previously participated in the tiddlywiki community? by \"community\" we refer to official spaces such as talk tiddlywiki as well as online-based third-party communities like the public discord server.": "No",
        "have you ever published a plugin or tiddlywiki extension of another type, which others can find, import and use? we define these as being publicly-hosted on your own webspace, or a host such as tiddlyhost.": "No",
        "how would you describe your main use cases for tiddlywiki?": "N/A - Still experimenting/no set use case for TiddlyWiki",
        "do you use tiddlywiki to support with your job or programme of education?": "No",
        "do you share your tiddlywiki(s) with other people? please select 'yes' if there is more than one person who can directly view your wiki.": "No, my TiddlyWiki is for personal use only",
        "putting it all together, what value does tiddlywiki provide for you in your day to day work, or in your life?": "Every few months I check back in with new TiddlyWiki developments (usually on the forum) and look at what awesome use cases people have found. TiddlyWiki is the Personal Knowledge Management software I'd like to use but not the one I currently use.",
        "what is your level of ability with tiddlywiki? this question assumes you can navigate tiddlywiki, use basic wikitext and save changes.": "I have customised TiddlyWiki through options and plugins",
        "how do you save changes in tiddlywiki?": "Single-file wiki with custom saver (e.g. TiddlyPWA, Timimi, tw5-browser-nativesaver)",
        "how do you back up/sync changes between systems?": "DIY (any other solution)",
        "as you selected diy, would be grateful for more details on the system you use to back up and synchronise your tiddlywiki across devices/systems.": "I've used Tailscale to expose the TiddlyPWA server to my other devices running Tailscale.",
        "are you positive about the future prospects of tiddlywiki?": "Yes",
        "are you confident that tiddlywiki will continue to meet your needs with future development?": "No",
        "are you satisfied with the way the project makes decisions?": "Yes",
        "what are we doing well? prompts for thinking: what are the aspects of tiddlywiki as a project and community that you find appealing? is there anything you are excited for in the future of tiddlywiki?": "I find that TiddlyWiki really nailed the customization and adapt the software to the user aspects along with a great model for thinking about information as atoms or discrete units that optionally build up into bigger ideas/thoughts/content or what have you. I'm pretty sure I can wrangle any type of content as long as it runs in the browser into TiddlyWiki.\n\nAlso the community is really kind and supportive, the leadership actively engages with it and listens to feedback which is amazing.",
        "what could we do better? prompts for thinking: could you imagine yourself leaving tiddlywiki? is there something you are afraid of in the future of tiddlywiki? what could change your relationship with tw and its community? what might encourage you to contribute more to the project?": "I could never settle into TiddlyWiki proper because while it can wrangle all types of content it still is pretty hard to insert that content in the first place and manage it. For example I can't use external tools to easily insert new tiddlers or slurp/ingest data from an API to then pull or push automagically into TW, in that regard I feel like I'm fighting the system. Because of that I find myself almost always returning to Emacs and org-mode due to easy and customizable capturing.",
        "with your consent, we would like to publish responses to this survey on tiddlywiki.com, in the spirit of open development. are you happy for your responses to be available online? we will not include information on your age or country of birth in the public results. those items of information will be kept strictly to a small and trusted group of regular contributors and administrators.": "Yes, I am happy for my responses to be published",
        "title": "Community Survey 2025 Answer 00057",
        "tags": "[[Community Survey 2025]]"
    }
]