[
    {
        "where did you first come across this survey?": "tiddlywiki.com",
        "would you consider yourself to be a programmer or software developer? you can consider yourself a programmer/developer without studying either discipline or doing it as a job.": "Yes, I would",
        "when did you first use tiddlywiki?": "2010",
        "do you currently participate, or have you previously participated in the tiddlywiki community? by \"community\" we refer to official spaces such as talk tiddlywiki as well as online-based third-party communities like the public discord server.": "Yes",
        "when did you begin taking part in the tiddlywiki community?": "2014",
        "we would be interested in knowing how you engage with the different communities of tw.: talk tiddlywiki": "I read and post in this community",
        "we would be interested in knowing how you engage with the different communities of tw.: old mailing list (google group)": "I do not engage with this community",
        "we would be interested in knowing how you engage with the different communities of tw.: r/tiddlywiki5 on reddit": "I do not engage with this community",
        "we would be interested in knowing how you engage with the different communities of tw.: discord": "I read/lurk, but do not post",
        "we would be interested in knowing how you engage with the different communities of tw.: github discussions": "I read/lurk, but do not post",
        "have you ever published a plugin or tiddlywiki extension of another type, which others can find, import and use? we define these as being publicly-hosted on your own webspace, or a host such as tiddlyhost.": "Yes",
        "how would you describe your main use cases for tiddlywiki?": "Note-taking;Task and project management (including CRMs);As a knowledge base (including technical, non-fiction and encyclopaedic content);Worldbuilding (e.g. for role-playing games);Programming",
        "do you use tiddlywiki to support with your job or programme of education?": "Yes",
        "do you share your tiddlywiki(s) with other people? please select 'yes' if there is more than one person who can directly view your wiki.": "Yes, and I am the only editor/administrator of my wiki(s)",
        "do you publish your wiki(s) online?: to the world wide web": "Yes, using a single-file wiki",
        "do you publish your wiki(s) online?: to an intranet": "Yes, served through Node.js",
        "putting it all together, what value does tiddlywiki provide for you in your day to day work, or in your life?": "I use TW to generate a personal website were I drop articles (blog posts), code snippets, photography photos, tips, journal musings, resume, etc. This is served as a single HTML file with static versions of tiddlers for SEO use. I serve Node version to localhost for work stuff",
        "what is your level of ability with tiddlywiki? this question assumes you can navigate tiddlywiki, use basic wikitext and save changes.": "I have customised TiddlyWiki through options and plugins;I am comfortable using WikiText widgets (e.g. <$transclude>, <$list>...);I am comfortable writing filter expressions;I have written custom HTML;I have written custom CSS styles;I have written custom JavaScript",
        "how do you save changes in tiddlywiki?": "Single-file wiki through web browser with Download Saver (default saving mechanism);Single-file wiki with custom saver (e.g. TiddlyPWA, Timimi, tw5-browser-nativesaver);Multi-file wiki served through Node.js",
        "how do you back up/sync changes between systems?": "DIY (any other solution)",
        "as you selected diy, would be grateful for more details on the system you use to back up and synchronise your tiddlywiki across devices/systems.": "For single-file wikis I store in a web hosted folder. For personal blog site (wiki) source is in Git (sourcehut). For node served sites I use tar via a cron job.",
        "we would love to know what your basic setup looks like in your most-used wiki. you can import the wiki info tiddler and paste the output below. find the wiki information tool here.": "<details><summary>Wiki Information Daily tasks and notes</summary><pre><code>\nTiddlyWiki Version: 5.3.7\nCurrent palette: $:/palettes/SolarizedDark\nCurrent theme: $:/themes/tiddlywiki/snowwhite\nCurrent layout: \nBrowser language setting: en-US\nDefault type for missing tiddlers: \nAuto save setting: yes\nCode wrapping setting: pre-wrap\nSticky titles setting: no\nSidebar layout setting: fluid-fixed\nAuto focus field setting for new tiddlers: title\nCurrent storyview setting: classic\nToolbar text setting: no\nToolbar icon setting: yes\nButton class setting: tc-btn-invisible\nNavigation address bar setting: no\nTiddler opening behaviour setting for navigations from outside the story river: top\nTiddler opening behaviour setting for navigations from within the story river: above\nCamelCase linking setting: disable\nKeyboard shortcuts that have been customised: $:/config/shortcuts-linux/make-pr-macro,$:/config/shortcuts/cancel-edit-tiddler,$:/config/shortcuts/make-pr-macro\nDisabled plugins: \nPlugins: \n  $:/core - 5.3.7\n  $:/plugins/crowdstrike - 5.3.7\n  $:/plugins/proxy - 5.3.7\n  $:/plugins/tiddlywiki/codemirror - 5.3.7\n  $:/plugins/tiddlywiki/codemirror-closebrackets - 5.3.7\n  $:/plugins/tiddlywiki/codemirror-keymap-vim - 5.3.7\n  $:/plugins/tiddlywiki/codemirror-search-replace - 5.3.7\n  $:/plugins/tiddlywiki/filesystem - 5.3.7\n  $:/plugins/tiddlywiki/highlight - 5.3.7\n  $:/plugins/tiddlywiki/markdown - 5.3.7\n  $:/plugins/tiddlywiki/railroad - 5.3.7\n  $:/plugins/tiddlywiki/tiddlyweb - 5.3.7\n  $:/temp/info-plugin - \n  $:/themes/tiddlywiki/snowwhite - 5.3.7\n  $:/themes/tiddlywiki/vanilla - 5.3.7\n</code></pre></details>\n\n<details><summary>Wiki Information Personal Blog Site</summary><pre><code>\nTiddlyWiki Version: 5.3.7\nCurrent palette: $:/palettes/Vanilla\nCurrent theme: $:/themes/tritarget/blog\nCurrent layout: \nBrowser language setting: en-US\nDefault type for missing tiddlers: \nAuto save setting: yes\nCode wrapping setting: pre-wrap\nSticky titles setting: no\nSidebar layout setting: fluid-fixed\nAuto focus field setting for new tiddlers: title\nCurrent storyview setting: classic\nToolbar text setting: no\nToolbar icon setting: yes\nButton class setting: tc-btn-invisible\nNavigation address bar setting: no\nTiddler opening behaviour setting for navigations from outside the story river: top\nTiddler opening behaviour setting for navigations from within the story river: below\nCamelCase linking setting: disable\nKeyboard shortcuts that have been customised: \nDisabled plugins: \nPlugins: \n  $:/core - 5.3.7\n  $:/plugins/dullroar/atomfeed - 0.0.3\n  $:/plugins/sukima/jsbin - 5.3.7\n  $:/plugins/sukima/obfuscate - 0.0.1\n  $:/plugins/sukima/pannellum - 2.2.0\n  $:/plugins/sukima/prepare-media - 5.3.7\n  $:/plugins/sukima/sourcecode - 0.0.1\n  $:/plugins/tiddlywiki/highlight - 5.3.7\n  $:/plugins/tiddlywiki/markdown - 5.3.7\n  $:/plugins/tiddlywiki/powered-by-tiddlywiki - 5.3.7\n  $:/plugins/tiddlywiki/qrcode - 5.3.7\n  $:/temp/info-plugin - \n  $:/themes/tiddlywiki/centralised - 5.3.7\n  $:/themes/tiddlywiki/snowwhite - 5.3.7\n  $:/themes/tiddlywiki/vanilla - 5.3.7\n  $:/themes/tritarget/blog - 5.3.7\n</code></pre></details>",
        "outside of plugins, palettes and other information captured above; are there any customisations you make to your tiddlywiki? these included but are not limited to: stylesheets, macros/functions/procedures, javascript, and direct edits to the core. please also mention if you used or built on customisations from the community.": "Honestly, I'm quick to customize styles, macros, and JavaScript. It is hard for me to list them all.",
        "are you positive about the future prospects of tiddlywiki?": "Yes",
        "are you confident that tiddlywiki will continue to meet your needs with future development?": "Yes",
        "are you satisfied with the way the project makes decisions?": "Yes",
        "what are we doing well? prompts for thinking: what are the aspects of tiddlywiki as a project and community that you find appealing? is there anything you are excited for in the future of tiddlywiki?": "For me it is about the core philosophies. 1. brain dumps, I can dump anything to a wiki and not have to fuss about how the information will be organized or presented. The concept of tiddlers frees me of that mental burden. 2. Core knowledge set. TW uses HTML, CSS, and JavaScript that's it. I know my TW will work on any modern PC because they all come with a web browser. Contributing needs nothing more than familiarity with MDN. No React, TypeScript, Vite, CI, Cloud, Database, blah blah blah.",
        "what could we do better? prompts for thinking: could you imagine yourself leaving tiddlywiki? is there something you are afraid of in the future of tiddlywiki? what could change your relationship with tw and its community? what might encourage you to contribute more to the project?": "I worry that the allure of more fancy looking systems (i.e. obsidian) could motivate the core code to migrate away from core standards like VanillaJS or single-file architecture like a siren's call. That the front end development industry is so saturated with wannabes that the drive to cater to the lowest common denominator sends software down an enshitification path of doom. The filter syntax though powerful can get confusing quickly especially with complex ideas. Improve the Widget API.",
        "with your consent, we would like to publish responses to this survey on tiddlywiki.com, in the spirit of open development. are you happy for your responses to be available online? we will not include information on your age or country of birth in the public results. those items of information will be kept strictly to a small and trusted group of regular contributors and administrators.": "Yes, I am happy for my responses to be published",
        "title": "Community Survey 2025 Answer 00105",
        "tags": "[[Community Survey 2025]]"
    }
]