[
    {
        "first-heard-survey": "Official newsletter",
        "other-survey-source": "",
        "are-you-a-dev": "Yes, I would",
        "first-used-tw": "2022",
        "joined-tw-community": "Yes",
        "started-tw-community": "2023",
        "use-ttw": "I read/lurk, but do not post",
        "use-mailing-list": "I read/lurk, but do not post",
        "use-reddit": "I do not engage with this community",
        "use-discord": "I do not engage with this community",
        "use-github-discuss": "I read/lurk, but do not post",
        "published-plugin": "No",
        "main-use-cases": "Note-taking;Journalling;As a knowledge base (including technical, non-fiction and encyclopaedic content)",
        "other-use-cases": "",
        "use-for-work-or-study": "Yes",
        "share-wikis": "No, my TiddlyWiki is for personal use only",
        "publish-to-web": "",
        "publish-to-intranet": "",
        "value-of-tw": "Ideas and knowledge don't get lost and become a very valuable resource to me.",
        "tw-ability-level": "I have customised TiddlyWiki through options and plugins;I am comfortable using WikiText widgets (e.g. <$transclude>, <$list>...);I am comfortable writing filter expressions;I have written custom HTML;I have written custom CSS styles;I have written custom JavaScript",
        "save-method": "Multi-file wiki served through Node.js;Single-file wiki with TiddlyDesktop",
        "backup-method": "Web or cloud hosting (other than TiddlyHost/TiddlySpot e.g. Netlify, AWS, OVH, Google Cloud...)",
        "diy-backup-info": "",
        "wiki-setup-info": "A docker container starts a node process for every wiki i have on a different port, around 15. A reverse proxy is configured to connect to those ports depending on the subdomain accessed. The data of all wikis lives in a folder that is shared using Syncthing. The other machines receiving the folder don't run Tiddlywiki, it's just nice to know access to the data does not depend on a single machine being available.",
        "tw-customisations": "I did quite some customizing for certain use cases i wanted to cover with Tiddlywiki. In every case, after it was done and some time has passed, i came to the conclusion i should focus on content, not on \"features\". I want to keep it simple.",
        "positive-about-future": "Yes",
        "tw-future-confidence": "Yes",
        "project-decision-trust": "Yes",
        "project-strengths": "Communication is great, i can follow topics i am interested in on the talk.tiddlywiki.org and GitHub.\n\nThe community of TW is outstanding.\n\nMWS is important to me, but i am unsure if it's ready for everyone yet. I want to be sure before breaking my current setup, so i still wait for it to become more mature.",
        "project-weaknesses": "I hope Tiddlywiki doesn't become too \"heavy\". The possibilities with filters/procedures/macros/widgets are surely great, but very overwhelming and sometimes quite frustrating, even with experience. Simple and powerful at the same time might be impossible. In some cases, maybe you should go with simple rather than powerful.\n\nI'd like the sidebar to look like a part of the application, visually.\n\nI fear that Jeremy could quit and development stops.\n\nI can't see myself stop using TW anyway.",
        "ok-to-publish": "Yes, I am happy for my responses to be published",
        "title": "Community Survey 2025 Answer 00014",
        "tags": "[[Community Survey 2025]]"
    }
]