[
    {
        "where did you first come across this survey?": "Other",
        "as you selected other, could you please provide more information on where you initially found this survey?": "User's Blog when searching for Wiki options.",
        "would you consider yourself to be a programmer or software developer? you can consider yourself a programmer/developer without studying either discipline or doing it as a job.": "Yes, I would",
        "when did you first use tiddlywiki?": "2025",
        "do you currently participate, or have you previously participated in the tiddlywiki community? by \"community\" we refer to official spaces such as talk tiddlywiki as well as online-based third-party communities like the public discord server.": "No",
        "have you ever published a plugin or tiddlywiki extension of another type, which others can find, import and use? we define these as being publicly-hosted on your own webspace, or a host such as tiddlyhost.": "No",
        "how would you describe your main use cases for tiddlywiki?": "N/A - Still experimenting/no set use case for TiddlyWiki",
        "do you use tiddlywiki to support with your job or programme of education?": "No",
        "do you share your tiddlywiki(s) with other people? please select 'yes' if there is more than one person who can directly view your wiki.": "No, my TiddlyWiki is for personal use only",
        "putting it all together, what value does tiddlywiki provide for you in your day to day work, or in your life?": "I can make notes and access them on any device without the need of a specific app.\nI can write/post about things that I care about like recipes, travel and instructions.",
        "what is your level of ability with tiddlywiki? this question assumes you can navigate tiddlywiki, use basic wikitext and save changes.": "My use is basic; I use TiddlyWiki in a configuration close to standard, without plugins",
        "how do you save changes in tiddlywiki?": "Single-file wiki with custom saver (e.g. TiddlyPWA, Timimi, tw5-browser-nativesaver)",
        "how do you back up/sync changes between systems?": "Git forge (GitHub, Gitea/Forgejo, GitLab)",
        "outside of plugins, palettes and other information captured above; are there any customisations you make to your tiddlywiki? these included but are not limited to: stylesheets, macros/functions/procedures, javascript, and direct edits to the core. please also mention if you used or built on customisations from the community.": "No",
        "are you positive about the future prospects of tiddlywiki?": "Yes",
        "are you confident that tiddlywiki will continue to meet your needs with future development?": "Yes",
        "are you satisfied with the way the project makes decisions?": "Yes",
        "what are we doing well? prompts for thinking: what are the aspects of tiddlywiki as a project and community that you find appealing? is there anything you are excited for in the future of tiddlywiki?": "I just got to the project very recently and I'm excited for what I'm seeing. Giving the power to users of running their own wikis is great.\nTiddlywiki is a clever solution, I'm sure it has taken a lot of time and experimenting to get it to where it's now. I love when a community project gets this far and in this shape.",
        "what could we do better? prompts for thinking: could you imagine yourself leaving tiddlywiki? is there something you are afraid of in the future of tiddlywiki? what could change your relationship with tw and its community? what might encourage you to contribute more to the project?": "I don't have much feedback, but I noticed there's 1,095 issues open in TW's github repo, and that looks like a tremendous backlog. I hope you get time and resources to sort those out.\n\nI know TW is not solving the auth problem, but I wish there was a way to make credentials (or auth tokens) available from a third-party to the TW so you could save automatically on any session/device you log in. Maybe this has already been done? I couldn't find a solution for this.",
        "with your consent, we would like to publish responses to this survey on tiddlywiki.com, in the spirit of open development. are you happy for your responses to be available online? we will not include information on your age or country of birth in the public results. those items of information will be kept strictly to a small and trusted group of regular contributors and administrators.": "Yes, I am happy for my responses to be published",
        "title": "Community Survey 2025 Answer 00132",
        "tags": "[[Community Survey 2025]]"
    }
]