[
    {
        "where did you first come across this survey?": "tiddlywiki.com",
        "would you consider yourself to be a programmer or software developer? you can consider yourself a programmer/developer without studying either discipline or doing it as a job.": "Yes, I would",
        "when did you first use tiddlywiki?": "2014",
        "do you currently participate, or have you previously participated in the tiddlywiki community? by \"community\" we refer to official spaces such as talk tiddlywiki as well as online-based third-party communities like the public discord server.": "Yes",
        "when did you begin taking part in the tiddlywiki community?": "2024",
        "we would be interested in knowing how you engage with the different communities of tw.: talk tiddlywiki": "I read and post in this community",
        "we would be interested in knowing how you engage with the different communities of tw.: old mailing list (google group)": "I read and post in this community",
        "we would be interested in knowing how you engage with the different communities of tw.: r/tiddlywiki5 on reddit": "I do not engage with this community",
        "we would be interested in knowing how you engage with the different communities of tw.: discord": "I do not engage with this community",
        "we would be interested in knowing how you engage with the different communities of tw.: github discussions": "I read/lurk, but do not post",
        "have you ever published a plugin or tiddlywiki extension of another type, which others can find, import and use? we define these as being publicly-hosted on your own webspace, or a host such as tiddlyhost.": "Yes",
        "how would you describe your main use cases for tiddlywiki?": "Note-taking;Task and project management (including CRMs);As a knowledge base (including technical, non-fiction and encyclopaedic content);Producing/publishing interactive fiction;Worldbuilding (e.g. for role-playing games);Narrative fiction writing (either supporting its creation or directly writing in TiddlyWiki);Programming;Other",
        "as you selected other: what are other primary use cases of tiddlywiki for you?": "Internau corporate knowledgebase. Often for personal use at first and later for the entire team or department.",
        "do you use tiddlywiki to support with your job or programme of education?": "Yes",
        "do you share your tiddlywiki(s) with other people? please select 'yes' if there is more than one person who can directly view your wiki.": "Yes, and I am the only editor/administrator of my wiki(s)",
        "do you publish your wiki(s) online?: to the world wide web": "Yes, using a single-file wiki",
        "do you publish your wiki(s) online?: to an intranet": "Yes, using a single-file wiki",
        "putting it all together, what value does tiddlywiki provide for you in your day to day work, or in your life?": "It helps in jotting down ideas, and work on it modularly. This saves a lot of time and lessen wasted resources. Depending on the project, it's either a supplement or the primary method side-by-side with traditional notebook notes and journals.",
        "what is your level of ability with tiddlywiki? this question assumes you can navigate tiddlywiki, use basic wikitext and save changes.": "I have customised TiddlyWiki through options and plugins;I am comfortable using WikiText widgets (e.g. <$transclude>, <$list>...);I am comfortable writing filter expressions;I have written custom HTML;I have written custom CSS styles",
        "how do you save changes in tiddlywiki?": "Single-file wiki through web browser with Download Saver (default saving mechanism);Single-file wiki with TiddlyDesktop",
        "how do you back up/sync changes between systems?": "TiddlySpot / TiddlyHost;Consumer online storage (e.g. Google Drive, Dropbox);Web or cloud hosting (other than TiddlyHost/TiddlySpot e.g. Netlify, AWS, OVH, Google Cloud...);Neocities, Nekoweb, tiiny.host, omg.lol and similar services;DIY (any other solution)",
        "as you selected diy, would be grateful for more details on the system you use to back up and synchronise your tiddlywiki across devices/systems.": "Syncthing. It works cross-platform (Android, Linux, iOS, macOS, Windows). While Syncthing can be used to sync online too, it's best for LAN sync'ing. I leave online backups in MEGA Sync and pCloud monthly.",
        "we would love to know what your basic setup looks like in your most-used wiki. you can import the wiki info tiddler and paste the output below. find the wiki information tool here.": "<details><summary>Wiki Information</summary><pre><code>\nTiddlyWiki Version: 5.3.7\nCurrent palette: $:/palettes/Twilight\nCurrent theme: $:/themes/tiddlywiki/snowwhite\nCurrent layout: \nBrowser language setting: en-PH\nDefault type for missing tiddlers: \nAuto save setting: no\nCode wrapping setting: pre-wrap\nSticky titles setting: yes\nSidebar layout setting: fluid-fixed\nAuto focus field setting for new tiddlers: title\nCurrent storyview setting: pop\nToolbar text setting: no\nToolbar icon setting: yes\nButton class setting: tc-btn-invisible\nNavigation address bar setting: no\nTiddler opening behaviour setting for navigations from outside the story river: top\nTiddler opening behaviour setting for navigations from within the story river: below\nCamelCase linking setting: disable\nKeyboard shortcuts that have been customised: $:/config/shortcuts-not-windows/switch-reader-mode\nDisabled plugins: $:/plugins/tiddlywiki/codemirror,$:/plugins/tiddlywiki/codemirror-closebrackets,$:/plugins/tiddlywiki/codemirror-mode-css,$:/plugins/tiddlywiki/codemirror-mode-htmlembedded,$:/plugins/tiddlywiki/codemirror-mode-htmlmixed,$:/plugins/tiddlywiki/codemirror-mode-javascript,$:/plugins/tiddlywiki/codemirror-mode-markdown,$:/plugins/tiddlywiki/codemirror-mode-xml,$:/plugins/tiddlywiki/codemirror-search-replace,$:/plugins/tiddlywiki/codemirror-trailingspace\nPlugins: \n  $:/core - 5.3.7\n  $:/languages/en-PH - 5.3.7\n  $:/plugins/flibbles/relink - 2.5.1\n  $:/plugins/flibbles/relink-fieldnames - 2.5.0\n  $:/plugins/flibbles/relink-markdown - 2.5.1\n  $:/plugins/flibbles/relink-titles - 2.4.0\n  $:/plugins/flibbles/relink-variables - 2.5.0\n  $:/plugins/Gk0Wk/CPL-Repo - 2025.03.29\n  $:/plugins/kookma/refnotes - 1.9.0\n  $:/plugins/kookma/shiraz - 3.0.12\n  $:/plugins/kookma/shiraz-callout - 0.8.0\n  $:/plugins/kookma/shiraz-formatter - 0.6.2\n  $:/plugins/kookma/tweaks - 0.2.2\n  $:/plugins/kookma/utility - 3.2.3\n  $:/plugins/tg/layout - 0.5.13\n  $:/plugins/tg/tiddlersbar - 0.0.22\n  $:/plugins/tg/topmenu - 0.1.21\n  $:/plugins/tiddlywiki/highlight - 5.3.7\n  $:/plugins/tiddlywiki/markdown - 5.3.7\n  $:/temp/info-plugin - \n  $:/themes/tiddlywiki/snowwhite - 5.3.7\n  $:/themes/tiddlywiki/vanilla - 5.3.7\n</code></pre></details>",
        "outside of plugins, palettes and other information captured above; are there any customisations you make to your tiddlywiki? these included but are not limited to: stylesheets, macros/functions/procedures, javascript, and direct edits to the core. please also mention if you used or built on customisations from the community.": "I added my preferred base CSS and font styles that I regularly use across different projects. Although the one I'm using for my TW sites are a bit old, since I'm still working on a fresh new one with only the latest in CSS and HTML.",
        "are you positive about the future prospects of tiddlywiki?": "Yes",
        "are you confident that tiddlywiki will continue to meet your needs with future development?": "Yes",
        "are you satisfied with the way the project makes decisions?": "Yes",
        "what are we doing well? prompts for thinking: what are the aspects of tiddlywiki as a project and community that you find appealing? is there anything you are excited for in the future of tiddlywiki?": "1. Very helpful and polite community. I'm an autistic, and a type of autistic who finds it hard to join in a new community even online. So, everyone being helpful and polite made it easy.\n2. Broad-minded team. I asked about creating an English Philippines translation, and it was welcomed with open arms. Generally, it's denied in projects because there's British and/or American English already.",
        "what could we do better? prompts for thinking: could you imagine yourself leaving tiddlywiki? is there something you are afraid of in the future of tiddlywiki? what could change your relationship with tw and its community? what might encourage you to contribute more to the project?": "Maybe the official documentation can also suggest other TW help/doc sites. The official docs is geared on the technical side, assuming one is in programmer mode. There are other TW help/doc sites written in a \"How-To\" way, or in wordy explanation way. It will help a wide range of users, as we all have different preferred way of learning.",
        "with your consent, we would like to publish responses to this survey on tiddlywiki.com, in the spirit of open development. are you happy for your responses to be available online? we will not include information on your age or country of birth in the public results. those items of information will be kept strictly to a small and trusted group of regular contributors and administrators.": "Yes, I am happy for my responses to be published",
        "title": "Community Survey 2025 Answer 00158",
        "tags": "[[Community Survey 2025]]"
    }
]