[
    {
        "where did you first come across this survey?": "Talk TiddlyWiki",
        "would you consider yourself to be a programmer or software developer? you can consider yourself a programmer/developer without studying either discipline or doing it as a job.": "Yes, I would",
        "when did you first use tiddlywiki?": "2024",
        "do you currently participate, or have you previously participated in the tiddlywiki community? by \"community\" we refer to official spaces such as talk tiddlywiki as well as online-based third-party communities like the public discord server.": "Yes",
        "when did you begin taking part in the tiddlywiki community?": "2024",
        "we would be interested in knowing how you engage with the different communities of tw.: talk tiddlywiki": "I read and post in this community",
        "we would be interested in knowing how you engage with the different communities of tw.: old mailing list (google group)": "I read/lurk, but do not post",
        "we would be interested in knowing how you engage with the different communities of tw.: r/tiddlywiki5 on reddit": "I read and post in this community",
        "we would be interested in knowing how you engage with the different communities of tw.: discord": "I read/lurk, but do not post",
        "we would be interested in knowing how you engage with the different communities of tw.: github discussions": "I do not engage with this community",
        "have you ever published a plugin or tiddlywiki extension of another type, which others can find, import and use? we define these as being publicly-hosted on your own webspace, or a host such as tiddlyhost.": "No",
        "how would you describe your main use cases for tiddlywiki?": "Note-taking;Journalling;Task and project management (including CRMs);As a knowledge base (including technical, non-fiction and encyclopaedic content);Producing/publishing interactive fiction;Worldbuilding (e.g. for role-playing games);Narrative fiction writing (either supporting its creation or directly writing in TiddlyWiki)",
        "do you use tiddlywiki to support with your job or programme of education?": "No",
        "do you share your tiddlywiki(s) with other people? please select 'yes' if there is more than one person who can directly view your wiki.": "No, my TiddlyWiki is for personal use only",
        "putting it all together, what value does tiddlywiki provide for you in your day to day work, or in your life?": "I use TW mostly for my video game universe, integrating elements of journalling, task management, non-fiction research data-basing, hypertextual narrative design, and World Building. I work more in the audio world in REAPER, and prefer TWs similar community driven customizability",
        "what is your level of ability with tiddlywiki? this question assumes you can navigate tiddlywiki, use basic wikitext and save changes.": "I have customised TiddlyWiki through options and plugins;I am comfortable using WikiText widgets (e.g. <$transclude>, <$list>...);I have written custom CSS styles",
        "how do you save changes in tiddlywiki?": "Single-file wiki with TiddlyDesktop;Single-file wiki with third-party desktop app (e.g. TidGi Desktop, twexe)",
        "how do you back up/sync changes between systems?": "N/A - I keep my wiki on a single system",
        "we would love to know what your basic setup looks like in your most-used wiki. you can import the wiki info tiddler and paste the output below. find the wiki information tool here.": "<details><summary>Wiki Information</summary><pre><code>\nTiddlyWiki Version: 5.3.6\nCurrent palette: $:/palettes/FlexokiDark EDITED 1\nCurrent theme: $:/themes/tiddlywiki/tight\nCurrent layout: \nBrowser language setting: en-US\nDefault type for missing tiddlers: \nAuto save setting: yes\nCode wrapping setting: pre-wrap\nSticky titles setting: yes\nSidebar layout setting: fluid-fixed\nAuto focus field setting for new tiddlers: title\nCurrent storyview setting: classic\nToolbar text setting: no\nToolbar icon setting: yes\nButton class setting: tc-btn-invisible\nNavigation address bar setting: no\nTiddler opening behaviour setting for navigations from outside the story river: top\nTiddler opening behaviour setting for navigations from within the story river: below\nCamelCase linking setting: disable\nKeyboard shortcuts that have been customised: \nDisabled plugins: $:/plugins/benwebber/crosslinks,$:/plugins/Gk0Wk/TW5-CodeMirror-Enhanced,$:/plugins/kookma/favorites,$:/plugins/kookma/indexer,$:/plugins/linonetwo/itonnote,$:/plugins/tiddlywiki/comments\nPlugins: \n  $:/core - 5.3.6\n  $:/plugins/benwebber/tag-count - 0.2.2\n  $:/plugins/eucaly/titleme - 0.0.1\n  $:/plugins/EvidentlyCube/AutoComplete - 1.0.20\n  $:/plugins/Gk0Wk/CPL-Repo - 2024.11.25\n  $:/plugins/Gk0Wk/drawio - 0.0.7\n  $:/plugins/Gk0Wk/focused-tiddler - 0.0.3\n  $:/plugins/Gk0Wk/sidebar-resizer - 0.0.6\n  $:/plugins/HCHaase/TOCgeneric - 2.2.1\n  $:/plugins/hoelzro/full-text-search - 1.1.0-4-g954307a\n  $:/plugins/jd/plainrevs - 0.0.20\n  $:/plugins/kixam/moment - 2.24.0\n  $:/plugins/kookma/commander - 2.1.13\n  $:/plugins/kookma/narenj - 0.5.0\n  $:/plugins/kookma/shiraz - 3.0.5\n  $:/plugins/kookma/shiraz-callout - 0.8.0\n  $:/plugins/kookma/shiraz-formatter - 0.6.0\n  $:/plugins/kookma/toc - 1.6.2\n  $:/plugins/kookma/trashbin - 1.3.4\n  $:/plugins/linonetwo/autocomplete - 0.4.0\n  $:/plugins/linonetwo/commandpalette - 2.0.2\n  $:/plugins/linonetwo/tidgi-ipc-syncadaptor - 0.1.0\n  $:/plugins/linonetwo/tidgi-ipc-syncadaptor-ui - 1.0.0\n  $:/plugins/linonetwo/title-caption - 0.3.1\n  $:/plugins/linonetwo/tw-calendar - 1.6.0\n  $:/plugins/linonetwo/tw-react - 1.0.0\n  $:/plugins/mabuqian/GuMo-Palettes - 0.1.1\n  $:/plugins/sk/FindReplace - 0.0.6\n  $:/plugins/telmiger/EditorCounter - 0.6.6\n  $:/plugins/telmiger/HarveyBalls - 0.0.6\n  $:/plugins/Telumire/Fonts - 0.0.2\n  $:/plugins/tg/chars-button - 0.0.11\n  $:/plugins/tg/layout - 0.5.13\n  $:/plugins/tg/leftmenu - 0.0.8\n  $:/plugins/tg/tiddlersbar - 0.0.22\n  $:/plugins/TheDiveO/FontAwesome - 1.2.22\n  $:/plugins/tiddlywiki/browser-sniff - 5.3.6\n  $:/plugins/tiddlywiki/filesystem - 5.3.6\n  $:/plugins/tiddlywiki/freelinks - 5.3.6\n  $:/plugins/tobibeer/appear - 0.6.2\n  $:/plugins/tobibeer/inc - 0.5.2\n  $:/plugins/tobibeer/xlist - 0.5.0\n  $:/plugins/xp/emoji-button - 0.2.2\n  $:/temp/info-plugin - \n  $:/themes/tg/mobie - 0.1.10\n  $:/themes/tiddlywiki/tight - 5.3.6\n  $:/themes/tiddlywiki/vanilla - 5.3.6-prerelease\n</code></pre></details>",
        "outside of plugins, palettes and other information captured above; are there any customisations you make to your tiddlywiki? these included but are not limited to: stylesheets, macros/functions/procedures, javascript, and direct edits to the core. please also mention if you used or built on customisations from the community.": "I use quite a few stylesheets which i have found through discussions in the community or on other tiddlys, often with my own customizations. \nI have a few custom macros built off others work to create structures for collapsible character bios and other similar structures.",
        "are you positive about the future prospects of tiddlywiki?": "Yes",
        "are you confident that tiddlywiki will continue to meet your needs with future development?": "Yes",
        "are you satisfied with the way the project makes decisions?": "Yes",
        "what are we doing well? prompts for thinking: what are the aspects of tiddlywiki as a project and community that you find appealing? is there anything you are excited for in the future of tiddlywiki?": "FOSS FTW! I personally love the decentralized community approach. I think discussions I've heard from the devs themselves sound like they are mostly going in the right directions, and the community has so many cool projects going. Since finding TW last year I've become a bit of an evangelist, showing it off to all my friends, and I don't think that will change any time soon the way its being run.",
        "what could we do better? prompts for thinking: could you imagine yourself leaving tiddlywiki? is there something you are afraid of in the future of tiddlywiki? what could change your relationship with tw and its community? what might encourage you to contribute more to the project?": "I'll keep using TW, i adopted it because it felt sturdy for long-term use.\nI have no fears about TWs future.\nI don't really see any problems at all wit hthe TW community, its been so helpful and supportive to me. \nI might contribute more to the project if there were better mobile tools, thats the one thing that i feel hasn't caught up, beyond fully capitalized, italic, bold, SAVING haha, but i think thats well known. A better mobile app would really help me and others use it more, etc.",
        "with your consent, we would like to publish responses to this survey on tiddlywiki.com, in the spirit of open development. are you happy for your responses to be available online? we will not include information on your age or country of birth in the public results. those items of information will be kept strictly to a small and trusted group of regular contributors and administrators.": "Yes, I am happy for my responses to be published",
        "title": "Community Survey 2025 Answer 00023",
        "tags": "[[Community Survey 2025]]"
    }
]