[
    {
        "first-heard-survey": "Other",
        "other-survey-source": "Most likely a Linux Forum. I can't honestly remember. I'm a Linux enthusiast and I had it on a floppy disk. It was likely before 2006.",
        "are-you-a-dev": "Yes, I would",
        "first-used-tw": "",
        "joined-tw-community": "No",
        "started-tw-community": "",
        "use-ttw": "",
        "use-mailing-list": "",
        "use-reddit": "",
        "use-discord": "",
        "use-github-discuss": "",
        "published-plugin": "No",
        "main-use-cases": "Note-taking;Journalling;Task and project management (including CRMs);As a knowledge base (including technical, non-fiction and encyclopaedic content)",
        "other-use-cases": "",
        "use-for-work-or-study": "Yes",
        "share-wikis": "No, but I may export content into other formats and share individual tiddlers, the whole wiki, or an extract of the wiki",
        "publish-to-web": "",
        "publish-to-intranet": "",
        "value-of-tw": "I use TiddlyWiki for thought streams. I don't use it frequently, but it helps me map out my thoughts when I do use it. I have also demonstrated TiddlyWiki to friends and colleagues who find it helpful. Some have even gone on to use it more than I have.",
        "tw-ability-level": "My use is basic; I use TiddlyWiki in a configuration close to standard, without plugins",
        "save-method": "Single-file wiki through web browser with Download Saver (default saving mechanism)",
        "backup-method": "No automatic sync across my devices",
        "diy-backup-info": "",
        "wiki-setup-info": "",
        "tw-customisations": "",
        "positive-about-future": "Yes",
        "tw-future-confidence": "Yes",
        "project-decision-trust": "Yes",
        "project-strengths": "TBH - I still run across TiddlyWiki files from when I first started using it (classic) - and they still work. So, I do not doubt that I can continue using it in the future. Some of my toddlers are new (v5) and I expect them to work as well.\nOnce I first figured out TW, it just clicked. I never became very involved in the community. But I may start looking into developing customization - not sure what, yet.",
        "project-weaknesses": "Although I've used TW for many years, I'm just starting to look into the community. In my opinion, from what I can tell, things are good.\nThe only reason I would stop using TW is if it became dependent on some technology that I do not have access to.\nEveryone that I've introduced to TW was also blown away by the capability and simplicity. So no issues.\nThanks!",
        "ok-to-publish": "Yes, I am happy for my responses to be published",
        "title": "Community Survey 2025 Answer 00131",
        "tags": "[[Community Survey 2025]]"
    }
]