[
    {
        "first-heard-survey": "Talk TiddlyWiki",
        "other-survey-source": "",
        "are-you-a-dev": "No, I would not",
        "first-used-tw": "2016",
        "joined-tw-community": "Yes",
        "started-tw-community": "2021",
        "use-ttw": "I read and post in this community",
        "use-mailing-list": "I read/lurk, but do not post",
        "use-reddit": "I read/lurk, but do not post",
        "use-discord": "I do not engage with this community",
        "use-github-discuss": "I read/lurk, but do not post",
        "published-plugin": "No",
        "main-use-cases": "Note-taking;Task and project management (including CRMs);As a knowledge base (including technical, non-fiction and encyclopaedic content);Producing/publishing interactive fiction;Worldbuilding (e.g. for role-playing games);Narrative fiction writing (either supporting its creation or directly writing in TiddlyWiki);Programming;Other",
        "other-use-cases": "creation of a tool for monitoring diabetes and calculating insulin injections",
        "use-for-work-or-study": "Yes",
        "share-wikis": "Yes, with multiple editors/administrators",
        "publish-to-web": "Yes, using a single-file wiki",
        "publish-to-intranet": "Not publishing to this location",
        "value-of-tw": "Easy to use, incredibly scalable, with the hability to support various contents, activities, projects..",
        "tw-ability-level": "I have customised TiddlyWiki through options and plugins;I am comfortable using WikiText widgets (e.g. <$transclude>, <$list>...);I am comfortable writing filter expressions;I have written custom HTML;I have written custom CSS styles",
        "save-method": "Single-file wiki with custom saver (e.g. TiddlyPWA, Timimi, tw5-browser-nativesaver);Multi-file wiki served through Node.js;Single-file wiki with third-party desktop app (e.g. TidGi Desktop, twexe);Single-file wiki third-party mobile app (e.g. Tiddloid, Quine)",
        "backup-method": "Web or cloud hosting (other than TiddlyHost/TiddlySpot e.g. Netlify, AWS, OVH, Google Cloud...);DIY (any other solution);N/A - I keep my wiki on a single system",
        "diy-backup-info": "syncthing or Proton Drive",
        "wiki-setup-info": "",
        "tw-customisations": "All my tiddlywiki are more or less heavily customized with html, css, edited interfaces.\nI regularly adjust the plugins I download to better suit my needs and I am starting to sable into developping my own plugins for some edgecases where I can't find any good solution.",
        "positive-about-future": "Yes",
        "tw-future-confidence": "Yes",
        "project-decision-trust": "Yes",
        "project-strengths": "A long-standing project, open source, keeping backward compatibility when possible, but in the end not requiring updates, meaning I can still use old database without update if I fear it would break them.\nThe possibility to create so many things, from a simple note page to pretty complex apps.\nThe possibility to share codes and information easily, and the presence of an helpful community.",
        "project-weaknesses": "More formatting option, maybe markdown support with bonus\nA good way to create a multi-user database (but that's a WIP).\nMost of Tiddlywiki.com is written from the perspective of an experienced user and is not beginner-friendly.\nSome preconfigured tiddlywiki editions could be useful. A custom builder that can suggest a list of add-ons based on intended use before allowing you do drag-and drop them in a few clicks could be an alternative, also being an introduction to plugins for beguiners.",
        "ok-to-publish": "Yes, I am happy for my responses to be published",
        "title": "Community Survey 2025 Answer 00051",
        "tags": "[[Community Survey 2025]]"
    }
]