[
    {
        "where did you first come across this survey?": "tiddlywiki.com",
        "would you consider yourself to be a programmer or software developer? you can consider yourself a programmer/developer without studying either discipline or doing it as a job.": "No, I would not",
        "when did you first use tiddlywiki?": "2008",
        "do you currently participate, or have you previously participated in the tiddlywiki community? by \"community\" we refer to official spaces such as talk tiddlywiki as well as online-based third-party communities like the public discord server.": "Yes",
        "when did you begin taking part in the tiddlywiki community?": "2023",
        "we would be interested in knowing how you engage with the different communities of tw.: talk tiddlywiki": "I read/lurk, but do not post",
        "we would be interested in knowing how you engage with the different communities of tw.: old mailing list (google group)": "I read and post in this community",
        "we would be interested in knowing how you engage with the different communities of tw.: r/tiddlywiki5 on reddit": "I do not engage with this community",
        "we would be interested in knowing how you engage with the different communities of tw.: discord": "I do not engage with this community",
        "we would be interested in knowing how you engage with the different communities of tw.: github discussions": "I do not engage with this community",
        "have you ever published a plugin or tiddlywiki extension of another type, which others can find, import and use? we define these as being publicly-hosted on your own webspace, or a host such as tiddlyhost.": "No",
        "how would you describe your main use cases for tiddlywiki?": "Note-taking;Journalling;Task and project management (including CRMs);As a knowledge base (including technical, non-fiction and encyclopaedic content);Other",
        "as you selected other: what are other primary use cases of tiddlywiki for you?": "Daily Studies PIM - I keep / share thoughts there - different from the above options",
        "do you use tiddlywiki to support with your job or programme of education?": "No",
        "do you share your tiddlywiki(s) with other people? please select 'yes' if there is more than one person who can directly view your wiki.": "No, my TiddlyWiki is for personal use only",
        "putting it all together, what value does tiddlywiki provide for you in your day to day work, or in your life?": "Unsure - I am still struggling with understand how to use it.\n\n* Simple things - Seem out of reach - for the most part - for me\n\n---\nNote: I do enjoy and am a fan of the software - I just don't get it (many times) on how to do simple things",
        "what is your level of ability with tiddlywiki? this question assumes you can navigate tiddlywiki, use basic wikitext and save changes.": "I have customised TiddlyWiki through options and plugins;I am comfortable using WikiText widgets (e.g. <$transclude>, <$list>...)",
        "how do you save changes in tiddlywiki?": "Single-file wiki through web browser with Download Saver (default saving mechanism);Single-file wiki with custom saver (e.g. TiddlyPWA, Timimi, tw5-browser-nativesaver)",
        "how do you back up/sync changes between systems?": "Git forge (GitHub, Gitea/Forgejo, GitLab);DIY (any other solution)",
        "as you selected diy, would be grateful for more details on the system you use to back up and synchronise your tiddlywiki across devices/systems.": "I use Syncthing - for backups - pulling from Gitlab",
        "we would love to know what your basic setup looks like in your most-used wiki. you can import the wiki info tiddler and paste the output below. find the wiki information tool here.": "I use a single files - One about 40 MB (with tags) in size; One over 120 MB in size (no tags)\n\nIt has everything for the past years - in two files.\n\nI learned how to use tags about 1 to 2 years ago - and although they are useful - they make my PIM \"sluggish\".\n\nI do enjoy the product and would even consider contributing - since I think I'm committed to using it now (more or less).",
        "outside of plugins, palettes and other information captured above; are there any customisations you make to your tiddlywiki? these included but are not limited to: stylesheets, macros/functions/procedures, javascript, and direct edits to the core. please also mention if you used or built on customisations from the community.": "To have the Tiddlywiki site be geared more towards \"end-users\" who do not program.\n\n* Example - I came to look to see how I can upgrade my 5.3.6 version - to 5.3.7 -- and I spent about 10 minutes looking on the portal - but I still don't know how to do it .",
        "are you positive about the future prospects of tiddlywiki?": "Yes",
        "are you confident that tiddlywiki will continue to meet your needs with future development?": "No",
        "are you satisfied with the way the project makes decisions?": "Yes",
        "what are we doing well? prompts for thinking: what are the aspects of tiddlywiki as a project and community that you find appealing? is there anything you are excited for in the future of tiddlywiki?": "I am not a programmer - just an \"End-User\" - and I WILL NEVER be a programmer - so please stop telling me to go in that direction.\n\n* The site is geared towards programmers - not end-users\n\n--- To help you understand\n\nAs a child - in school - I had questions - I would stand up and ask - one day we had a substitute teacher - he told me to sit down (that my question was stupid - yes, I am older - they used to say that) - I sat down - but I told him \"In my heart - I am still standing up\".",
        "what could we do better? prompts for thinking: could you imagine yourself leaving tiddlywiki? is there something you are afraid of in the future of tiddlywiki? what could change your relationship with tw and its community? what might encourage you to contribute more to the project?": "If there was a section called \"n00bs check here\" - Newbies - New to Tiddlywiki - ,....\n\n* Something that allows us to contribute - SIMPLE - ideas - even if the developers don't think they are useful\n\nExample: (what brought me here today)\n\nn00b: How do I upgrade to v5.3.7 from v5.3.6? (Since it's not on the main portal - nor searchable)\n\nAnswer: Click and download (this); Open it; Drag your existing wiki on-top of the page; Save it; Done\n* Some pictures to show this\n",
        "with your consent, we would like to publish responses to this survey on tiddlywiki.com, in the spirit of open development. are you happy for your responses to be available online? we will not include information on your age or country of birth in the public results. those items of information will be kept strictly to a small and trusted group of regular contributors and administrators.": "Yes, I am happy for my responses to be published",
        "title": "Community Survey 2025 Answer 00143",
        "tags": "[[Community Survey 2025]]"
    }
]