[
    {
        "first-heard-survey": "tiddlywiki.com",
        "other-survey-source": "",
        "are-you-a-dev": "No, I would not",
        "first-used-tw": "2008",
        "joined-tw-community": "Yes",
        "started-tw-community": "2023",
        "use-ttw": "I read/lurk, but do not post",
        "use-mailing-list": "I read and post in this community",
        "use-reddit": "I do not engage with this community",
        "use-discord": "I do not engage with this community",
        "use-github-discuss": "I do not engage with this community",
        "published-plugin": "No",
        "main-use-cases": "Note-taking;Journalling;Task and project management (including CRMs);As a knowledge base (including technical, non-fiction and encyclopaedic content);Other",
        "other-use-cases": "Daily Studies PIM - I keep / share thoughts there - different from the above options",
        "use-for-work-or-study": "No",
        "share-wikis": "No, my TiddlyWiki is for personal use only",
        "publish-to-web": "",
        "publish-to-intranet": "",
        "value-of-tw": "Unsure - I am still struggling with understand how to use it.\n\n* Simple things - Seem out of reach - for the most part - for me\n\n---\nNote: I do enjoy and am a fan of the software - I just don't get it (many times) on how to do simple things",
        "tw-ability-level": "I have customised TiddlyWiki through options and plugins;I am comfortable using WikiText widgets (e.g. <$transclude>, <$list>...)",
        "save-method": "Single-file wiki through web browser with Download Saver (default saving mechanism);Single-file wiki with custom saver (e.g. TiddlyPWA, Timimi, tw5-browser-nativesaver)",
        "backup-method": "Git forge (GitHub, Gitea/Forgejo, GitLab);DIY (any other solution)",
        "diy-backup-info": "I use Syncthing - for backups - pulling from Gitlab",
        "wiki-setup-info": "I use a single files - One about 40 MB (with tags) in size; One over 120 MB in size (no tags)\n\nIt has everything for the past years - in two files.\n\nI learned how to use tags about 1 to 2 years ago - and although they are useful - they make my PIM \"sluggish\".\n\nI do enjoy the product and would even consider contributing - since I think I'm committed to using it now (more or less).",
        "tw-customisations": "To have the Tiddlywiki site be geared more towards \"end-users\" who do not program.\n\n* Example - I came to look to see how I can upgrade my 5.3.6 version - to 5.3.7 -- and I spent about 10 minutes looking on the portal - but I still don't know how to do it .",
        "positive-about-future": "Yes",
        "tw-future-confidence": "No",
        "project-decision-trust": "Yes",
        "project-strengths": "I am not a programmer - just an \"End-User\" - and I WILL NEVER be a programmer - so please stop telling me to go in that direction.\n\n* The site is geared towards programmers - not end-users\n\n--- To help you understand\n\nAs a child - in school - I had questions - I would stand up and ask - one day we had a substitute teacher - he told me to sit down (that my question was stupid - yes, I am older - they used to say that) - I sat down - but I told him \"In my heart - I am still standing up\".",
        "project-weaknesses": "If there was a section called \"n00bs check here\" - Newbies - New to Tiddlywiki - ,....\n\n* Something that allows us to contribute - SIMPLE - ideas - even if the developers don't think they are useful\n\nExample: (what brought me here today)\n\nn00b: How do I upgrade to v5.3.7 from v5.3.6? (Since it's not on the main portal - nor searchable)\n\nAnswer: Click and download (this); Open it; Drag your existing wiki on-top of the page; Save it; Done\n* Some pictures to show this",
        "ok-to-publish": "Yes, I am happy for my responses to be published",
        "title": "Community Survey 2025 Answer 00143",
        "tags": "[[Community Survey 2025]]"
    }
]