[
    {
        "first-heard-survey": "Discord",
        "other-survey-source": "",
        "are-you-a-dev": "Yes, I would",
        "first-used-tw": "2021",
        "joined-tw-community": "No",
        "started-tw-community": "",
        "use-ttw": "",
        "use-mailing-list": "",
        "use-reddit": "",
        "use-discord": "",
        "use-github-discuss": "",
        "published-plugin": "No",
        "main-use-cases": "N/A - Still experimenting/no set use case for TiddlyWiki",
        "other-use-cases": "",
        "use-for-work-or-study": "No",
        "share-wikis": "No, my TiddlyWiki is for personal use only",
        "publish-to-web": "",
        "publish-to-intranet": "",
        "value-of-tw": "Every few months I check back in with new TiddlyWiki developments (usually on the forum) and look at what awesome use cases people have found. TiddlyWiki is the Personal Knowledge Management software I'd like to use but not the one I currently use.",
        "tw-ability-level": "I have customised TiddlyWiki through options and plugins",
        "save-method": "Single-file wiki with custom saver (e.g. TiddlyPWA, Timimi, tw5-browser-nativesaver)",
        "backup-method": "DIY (any other solution)",
        "diy-backup-info": "I've used Tailscale to expose the TiddlyPWA server to my other devices running Tailscale.",
        "wiki-setup-info": "",
        "tw-customisations": "",
        "positive-about-future": "Yes",
        "tw-future-confidence": "No",
        "project-decision-trust": "Yes",
        "project-strengths": "I find that TiddlyWiki really nailed the customization and adapt the software to the user aspects along with a great model for thinking about information as atoms or discrete units that optionally build up into bigger ideas/thoughts/content or what have you. I'm pretty sure I can wrangle any type of content as long as it runs in the browser into TiddlyWiki.\n\nAlso the community is really kind and supportive, the leadership actively engages with it and listens to feedback which is amazing.",
        "project-weaknesses": "I could never settle into TiddlyWiki proper because while it can wrangle all types of content it still is pretty hard to insert that content in the first place and manage it. For example I can't use external tools to easily insert new tiddlers or slurp/ingest data from an API to then pull or push automagically into TW, in that regard I feel like I'm fighting the system. Because of that I find myself almost always returning to Emacs and org-mode due to easy and customizable capturing.",
        "ok-to-publish": "Yes, I am happy for my responses to be published",
        "title": "Community Survey 2025 Answer 00057",
        "tags": "[[Community Survey 2025]]"
    }
]