[
    {
        "first-heard-survey": "Other",
        "other-survey-source": "User's Blog when searching for Wiki options.",
        "are-you-a-dev": "Yes, I would",
        "first-used-tw": "2025",
        "joined-tw-community": "No",
        "started-tw-community": "",
        "use-ttw": "",
        "use-mailing-list": "",
        "use-reddit": "",
        "use-discord": "",
        "use-github-discuss": "",
        "published-plugin": "No",
        "main-use-cases": "N/A - Still experimenting/no set use case for TiddlyWiki",
        "other-use-cases": "",
        "use-for-work-or-study": "No",
        "share-wikis": "No, my TiddlyWiki is for personal use only",
        "publish-to-web": "",
        "publish-to-intranet": "",
        "value-of-tw": "I can make notes and access them on any device without the need of a specific app.\nI can write/post about things that I care about like recipes, travel and instructions.",
        "tw-ability-level": "My use is basic; I use TiddlyWiki in a configuration close to standard, without plugins",
        "save-method": "Single-file wiki with custom saver (e.g. TiddlyPWA, Timimi, tw5-browser-nativesaver)",
        "backup-method": "Git forge (GitHub, Gitea/Forgejo, GitLab)",
        "diy-backup-info": "",
        "wiki-setup-info": "",
        "tw-customisations": "No",
        "positive-about-future": "Yes",
        "tw-future-confidence": "Yes",
        "project-decision-trust": "Yes",
        "project-strengths": "I just got to the project very recently and I'm excited for what I'm seeing. Giving the power to users of running their own wikis is great.\nTiddlywiki is a clever solution, I'm sure it has taken a lot of time and experimenting to get it to where it's now. I love when a community project gets this far and in this shape.",
        "project-weaknesses": "I don't have much feedback, but I noticed there's 1,095 issues open in TW's github repo, and that looks like a tremendous backlog. I hope you get time and resources to sort those out.\n\nI know TW is not solving the auth problem, but I wish there was a way to make credentials (or auth tokens) available from a third-party to the TW so you could save automatically on any session/device you log in. Maybe this has already been done? I couldn't find a solution for this.",
        "ok-to-publish": "Yes, I am happy for my responses to be published",
        "title": "Community Survey 2025 Answer 00132",
        "tags": "[[Community Survey 2025]]"
    }
]